{
  "backend/main.mo": "Defines backend actor with user profiles, goals, run logs, achievements, motivation data, and access‑controlled query methods plus comparison helpers.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Provides short descriptions of all frontend files for documentation or build planning.",
  "frontend/index.css": "Tailwind CSS setup defining color variables, light/dark themes, and base styling.",
  "frontend/index.html": "HTML entry point mounting the app root and loading the main script.",
  "frontend/src/App.tsx": "Sets up TanStack Router, theme provider, and clears query cache on logout.",
  "frontend/src/components/achievements/AchievementsGrid.tsx": "Renders achievement cards showing earned and locked badges using catalog data.",
  "frontend/src/components/auth/AuthButton.tsx": "Sign‑in/sign‑out button handling Internet Identity login flow and cache clearing.",
  "frontend/src/components/auth/GuestModeBanner.tsx": "Banner informing users they are in guest mode with a sign‑in prompt.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog that collects an optional display name and saves it via a mutation with loading and toast feedback.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout providing header, footer, social links, attribution, and bottom navigation.",
  "frontend/src/components/motivation/CelebrationBanner.tsx": "Alert banner that displays newly unlocked achievements with a trophy icon.",
  "frontend/src/components/motivation/MotivationCard.tsx": "Card showing a motivation message, goal progress, and loading skeletons when needed.",
  "frontend/src/components/navigation/BottomNav.tsx": "Mobile bottom navigation bar with route-aware icons for Home, Log Run, History, and Settings.",
  "frontend/src/components/reminders/ReminderBanner.tsx": "Banner reminding users to log a run based on reminder preferences and time, with quick navigation to the log page.",
  "frontend/src/components/system/ErrorCallout.tsx": "Destructive alert for showing errors with an optional retry button.",
  "frontend/src/hooks/queries/useAchievements.ts": "React Query hook fetching achievements from the actor when available.",
  "frontend/src/hooks/queries/useDashboardSummary.ts": "Aggregates goals, logs, motivation, and achievements into a dashboard summary with new-achievement detection.",
  "frontend/src/hooks/queries/useGoals.ts": "Hooks for fetching goals and saving the daily goal with query invalidation.",
  "frontend/src/hooks/queries/useRunLogs.ts": "Hooks for fetching run logs and adding a log while invalidating related queries.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated or anonymous backend actor and refreshes dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity login state, identity loading, and login helpers.",
  "frontend/src/hooks/usePrincipal.ts": "Returns the current principal string or 'guest' if unauthenticated.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks to fetch and save the caller's user profile via an actor API.",
  "frontend/src/index.css": "Defines Tailwind base styles and extensive CSS variables for light and dark themes.",
  "frontend/src/lib/achievementsCatalog.ts": "Exports a static catalog of achievement definitions with IDs, names, and descriptions.",
  "frontend/src/lib/preferences.ts": "Manages reading and writing reminder preferences per principal using localStorage.",
  "frontend/src/lib/streak.ts": "Computes streak metrics, today's completion, and formats distances for display.",
  "frontend/src/lib/submitGuards.ts": "Prevents duplicate form submissions within a short time window using a hash check.",
  "frontend/src/lib/validation.ts": "Validates run log inputs, ensuring positive duration and reasonable distance values.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/DashboardPage.tsx": "Renders the dashboard with profile status, streaks, achievements, and banners using multiple data hooks.",
  "frontend/src/pages/HistoryPage.tsx": "Displays a list of recent run logs with loading, empty, and error states.",
  "frontend/src/pages/LogRunPage.tsx": "Form page for logging a run with validation, duplicate submit prevention, and mutation handling.",
  "frontend/src/pages/RunLogDetailPage.tsx": "Displays a detailed view of a specific run log with date, duration, optional distance, and loading/error states.",
  "frontend/src/pages/SettingsPage.tsx": "Provides UI for managing daily goals and reminder preferences, including saving goals and persisting reminder settings.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters with sessionStorage support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, custom colors, animations, and plugin setup.",
  "project_state.json": "Project metadata describing app goals, features, requirements, and image assets needed."
}