{
  "backend/main.mo": "Defines the backend actor for user profiles, goals, run logs, motivation, and achievements with access control and comparison helpers.",
  "feature_evidence.json": "Feature evidence report listing implemented features, involved components, related files, and test references.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files describing page components, UI elements, hooks, and system utilities.",
  "frontend/index.css": "Tailwind CSS setup defining light and dark theme variables and base styling for the frontend.",
  "frontend/index.html": "Basic HTML entry point loading the root React application and main TypeScript bundle.",
  "frontend/src/App.tsx": "Configures TanStack Router routes, global layout, theme provider, and query cache clearing on logout.",
  "frontend/src/components/achievements/AchievementsGrid.tsx": "Displays all achievements with locked/earned states, icons, descriptions, and unlock dates using a catalog.",
  "frontend/src/components/auth/AuthButton.tsx": "Sign-in/sign-out button managing Internet Identity login flow with loading states and cache clearing.",
  "frontend/src/components/auth/GuestModeBanner.tsx": "Alert banner informing users they are in guest mode and offering a sign‑in button.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog for first‑time profile setup allowing users to enter a display name and save their profile.",
  "frontend/src/components/layout/AppLayout.tsx": "Provides the main app layout with header, footer, social links, and bottom navigation, wrapping all page content.",
  "frontend/src/components/motivation/CelebrationBanner.tsx": "Displays a celebratory alert listing newly unlocked achievements or hides if none exist.",
  "frontend/src/components/motivation/MotivationCard.tsx": "Shows a motivational message, daily progress, and goal details with loading skeleton support.",
  "frontend/src/components/navigation/BottomNav.tsx": "Renders a fixed mobile bottom navigation bar with route-aware highlighting and navigation actions.",
  "frontend/src/components/reminders/ReminderBanner.tsx": "Shows a reminder alert prompting users to log a run based on preferences and completion state.",
  "frontend/src/components/system/ErrorCallout.tsx": "Displays an error alert with optional retry action.",
  "frontend/src/hooks/queries/useAchievements.ts": "Fetches user achievements using the actor with React Query.",
  "frontend/src/hooks/queries/useDashboardSummary.ts": "Aggregates goals, logs, achievements, motivation message, and streak data into a dashboard summary.",
  "frontend/src/hooks/queries/useGoals.ts": "Provides hooks to fetch and save user goals with cache invalidation.",
  "frontend/src/hooks/queries/useRunLogs.ts": "Fetches run logs and supports adding new logs with related query invalidation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login, logout, and identity persistence.",
  "frontend/src/hooks/usePrincipal.ts": "Returns the caller's principal or 'guest' if unauthenticated.",
  "frontend/src/hooks/useQueries.ts": "Provides hooks to fetch and update the caller’s user profile using the actor.",
  "frontend/src/index.css": "Sets Tailwind layers and defines extensive CSS variables for light/dark themes and base typography.",
  "frontend/src/lib/achievementsCatalog.ts": "Defines an achievement catalog interface and exports a static list of predefined achievements.",
  "frontend/src/lib/preferences.ts": "Loads and saves per‑user reminder preferences to localStorage with fallback handling.",
  "frontend/src/lib/streak.ts": "Provides functions for checking if today's run is completed, computing streaks, and formatting distances.",
  "frontend/src/lib/submitGuards.ts": "Prevents duplicate form submissions within a short time window by hashing form data.",
  "frontend/src/lib/validation.ts": "Validates run log duration and distance, returning error messages for invalid fields.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/DashboardPage.tsx": "Renders the main dashboard with profile setup, status cards, banners, and streak/achievement summaries.",
  "frontend/src/pages/HistoryPage.tsx": "Displays recent run logs with loading and error states and allows navigating to run details.",
  "frontend/src/pages/LogRunPage.tsx": "Form for logging a run with validation, duplicate‑submit prevention, and submission via mutation.",
  "frontend/src/pages/RunLogDetailPage.tsx": "Displays detailed information for a selected run log, handling loading, errors, and navigation back to history.",
  "frontend/src/pages/SettingsPage.tsx": "Provides UI for managing daily goals and reminder preferences, including validation and save actions.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, animations, and plugins for the app’s UI styling.",
  "project_state.json": "Defines the project’s current state, features, issues, and branding requirements for the running motivation app."
}