{
  "kind": "build_request",
  "title": "Update PacePower app logo",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-10",
      "text": "Create a new PacePower logo image (replacing the current header logo) and include it as a static asset under frontend/public/assets/generated.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "change the logo please"
        ]
      },
      "acceptanceCriteria": [
        "A new logo image file exists in frontend/public/assets/generated.",
        "The logo is visually distinct from the old logo and reads as PacePower branding (visual mark only; no required text).",
        "The image has a transparent background (or otherwise looks correct on both light and dark backgrounds)."
      ]
    },
    {
      "id": "REQ-11",
      "text": "Update the app header to use the new PacePower logo image instead of /assets/generated/run-logo.dim_512x512.png, without changing the visible app name text ('PacePower') or the logo alt text ('PacePower').",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "change the logo please"
        ]
      },
      "acceptanceCriteria": [
        "The header logo displayed in the UI uses the new image path.",
        "The header still shows the text label 'PacePower'.",
        "The header logo <img> alt attribute remains 'PacePower'.",
        "No other screens are broken by the logo change."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (read-only UI component sources must be composed, not edited).",
    "Do not change backend code/state; this is a frontend-only branding asset update."
  ],
  "nonGoals": [
    "Redesigning the overall UI theme or color palette beyond what is necessary for the logo swap.",
    "Changing the app name text (it should remain 'PacePower').",
    "Adding third-party branding assets or external image hosting."
  ],
  "imageRequirements": {
    "required": [],
    "edits": [
      "Redesign the existing logo with updated PacePower branding (run-logo.dim_512x512.png > pacepower-logo.dim_512x512.png)"
    ]
  }
}